/*Задача №7: Цикличный вывод данных на экран Задание
        Необходимо с помощью цикла вывести на экран числа от 1 до 50.*/

public class Task_7 {
    public static void main(String[] args) {
        for (int i = 1; i <= 50; i++) {
            System.out.println(i);
        }

    }
}
